CoreBoxer/ADAS_panel/projects/imxrt1060-nxp-evk/board/MCUX_Config/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2C1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2C1Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 is configured as LPI2C1_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_00 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 is configured as LPI2C1_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_01 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 PAD functional properties : */
      0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Enabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 22K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 PAD functional properties : */
      0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Enabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 22K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
}

void BOARD_InitSDIOPins(void) {
	  CLOCK_EnableClock(kCLOCK_Iomuxc);
		IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,        /* GPIO_AD_B1_03 is configured as GPIO1_IO19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_12_GPIO2_IO28,           /* GPIO_B1_12 is configured as GPIO2_IO28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
		IOMUXC_SetPinMux(
				IOMUXC_GPIO_B1_14_USDHC1_VSELECT,       /* GPIO_B1_14 is configured as USDHC1_VSELECT */
				0U);                                    /* Software Input On Field: Input Path is determined by functionality */
		IOMUXC_SetPinMux(
				IOMUXC_GPIO_SD_B0_00_USDHC1_CMD,        /* GPIO_SD_B0_00 is configured as USDHC1_CMD */
				0U);                                    /* Software Input On Field: Input Path is determined by functionality */
		IOMUXC_SetPinMux(
				IOMUXC_GPIO_SD_B0_01_USDHC1_CLK,        /* GPIO_SD_B0_01 is configured as USDHC1_CLK */
				0U);                                    /* Software Input On Field: Input Path is determined by functionality */
		IOMUXC_SetPinMux(
				IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0,      /* GPIO_SD_B0_02 is configured as USDHC1_DATA0 */
				0U);                                    /* Software Input On Field: Input Path is determined by functionality */
		IOMUXC_SetPinMux(
				IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1,      /* GPIO_SD_B0_03 is configured as USDHC1_DATA1 */
				0U);                                    /* Software Input On Field: Input Path is determined by functionality */
		IOMUXC_SetPinMux(
				IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2,      /* GPIO_SD_B0_04 is configured as USDHC1_DATA2 */
				0U);                                    /* Software Input On Field: Input Path is determined by functionality */
		IOMUXC_SetPinMux(
				IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3,      /* GPIO_SD_B0_05 is configured as USDHC1_DATA3 */
				0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,        /* GPIO_AD_B1_03 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
		IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_12_GPIO2_IO28,           /* GPIO_B1_12 PAD functional properties : */
      0x017089u);                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled */
		IOMUXC_SetPinConfig(
				IOMUXC_GPIO_B1_14_USDHC1_VSELECT,       /* GPIO_B1_14 PAD functional properties : */
				0x0170A1u);                             /* Slew Rate Field: Fast Slew Rate
																									 Drive Strength Field: R0/4
																									 Speed Field: medium(100MHz)
																									 Open Drain Enable Field: Open Drain Disabled
																									 Pull / Keep Enable Field: Pull/Keeper Enabled
																									 Pull / Keep Select Field: Pull
																									 Pull Up / Down Config. Field: 47K Ohm Pull Up
																									 Hyst. Enable Field: Hysteresis Enabled */
		IOMUXC_SetPinConfig(
				IOMUXC_GPIO_SD_B0_00_USDHC1_CMD,        /* GPIO_SD_B0_00 PAD functional properties : */
				0x017089u);                             /* Slew Rate Field: Fast Slew Rate
																									 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
																									 Speed Field: medium(100MHz)
																									 Open Drain Enable Field: Open Drain Disabled
																									 Pull / Keep Enable Field: Pull/Keeper Enabled
																									 Pull / Keep Select Field: Pull
																									 Pull Up / Down Config. Field: 47K Ohm Pull Up
																									 Hyst. Enable Field: Hysteresis Enabled */
		IOMUXC_SetPinConfig(
				IOMUXC_GPIO_SD_B0_01_USDHC1_CLK,        /* GPIO_SD_B0_01 PAD functional properties : */
				0x014089u);                             /* Slew Rate Field: Fast Slew Rate
																									 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
																									 Speed Field: medium(100MHz)
																									 Open Drain Enable Field: Open Drain Disabled
																									 Pull / Keep Enable Field: Pull/Keeper Disabled
																									 Pull / Keep Select Field: Keeper
																									 Pull Up / Down Config. Field: 47K Ohm Pull Up
																									 Hyst. Enable Field: Hysteresis Enabled */
		IOMUXC_SetPinConfig(
				IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0,      /* GPIO_SD_B0_02 PAD functional properties : */
				0x017089u);                             /* Slew Rate Field: Fast Slew Rate
																									 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
																									 Speed Field: medium(100MHz)
																									 Open Drain Enable Field: Open Drain Disabled
																									 Pull / Keep Enable Field: Pull/Keeper Enabled
																									 Pull / Keep Select Field: Pull
																									 Pull Up / Down Config. Field: 47K Ohm Pull Up
																									 Hyst. Enable Field: Hysteresis Enabled */
		IOMUXC_SetPinConfig(
				IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1,      /* GPIO_SD_B0_03 PAD functional properties : */
				0x017089u);                             /* Slew Rate Field: Fast Slew Rate
																									 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
																									 Speed Field: medium(100MHz)
																									 Open Drain Enable Field: Open Drain Disabled
																									 Pull / Keep Enable Field: Pull/Keeper Enabled
																									 Pull / Keep Select Field: Pull
																									 Pull Up / Down Config. Field: 47K Ohm Pull Up
																									 Hyst. Enable Field: Hysteresis Enabled */
		IOMUXC_SetPinConfig(
				IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2,      /* GPIO_SD_B0_04 PAD functional properties : */
				0x017089u);                             /* Slew Rate Field: Fast Slew Rate
																									 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
																									 Speed Field: medium(100MHz)
																									 Open Drain Enable Field: Open Drain Disabled
																									 Pull / Keep Enable Field: Pull/Keeper Enabled
																									 Pull / Keep Select Field: Pull
																									 Pull Up / Down Config. Field: 47K Ohm Pull Up
																									 Hyst. Enable Field: Hysteresis Enabled */
		IOMUXC_SetPinConfig(
				IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3,      /* GPIO_SD_B0_05 PAD functional properties : */
				0x017089u);                             /* Slew Rate Field: Fast Slew Rate
																									 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
																									 Speed Field: medium(100MHz)
																									 Open Drain Enable Field: Open Drain Disabled
																									 Pull / Keep Enable Field: Pull/Keeper Enabled
																									 Pull / Keep Select Field: Pull
																									 Pull Up / Down Config. Field: 47K Ohm Pull Up
																									 Hyst. Enable Field: Hysteresis Enabled */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
